

Command Line Interface
UserDevice> AT+MAEURD1?
Mode        : 0. Disabled
OK
UserDevice> AT+MAEURD1=?
Command Syntax:
AT+MAEURD1[=<Mode>[,<Remote IP>,<Remote Port>,<Interval Time>[,<Interfaces>]]]
Mode         : 0  Disable
               1  Modem Event Report
               2  Management Report
Remote IP    : valid IP address
Remote Port  : 0 to 65535
Interval Time: 0 to 65535 seconds
Interfaces   : 0  Disable; 1  Enable
 For Modem Event Report:
   0 / 1 : Modem
   0 / 1 : WWAN
   0 / 1 : WWAN IP
 For Management Report:
   0 / 1 : Ethernet
   0 / 1 : WWAN
   0 / 1 : Network
OK
UserDevice> AT+MAEURD1=           

UserDevice> AT+MAEURD2?
Mode        : 0. Disabled
OK
UserDevice> AT+MAEURD2=?
Command Syntax:
AT+MAEURD2[=<Mode>[,<Remote IP>,<Remote Port>,<Interval Time>[,<Interfaces>]]]
Mode         : 0  Disable
               1  Modem Event Report
               2  Management Report
Remote IP    : valid IP address
Remote Port  : 0 to 65535
Interval Time: 0 to 65535 seconds
Interfaces   : 0  Disable; 1  Enable
 For Modem Event Report:
   0 / 1 : Modem
   0 / 1 : WWAN
   0 / 1 : WWAN IP
 For Management Report:
   0 / 1 : Ethernet
   0 / 1 : WWAN
   0 / 1 : Network
OK
UserDevice> AT+MAEURD2=           

UserDevice> AT+MAEURD3?
Mode        : 0. Disabled
OK
UserDevice> AT+MAEURD3=?
Command Syntax:
AT+MAEURD3[=<Mode>[,<Remote IP>,<Remote Port>,<Interval Time>[,<Interfaces>]]]
Mode         : 0  Disable
               1  Modem Event Report
               2  Management Report
Remote IP    : valid IP address
Remote Port  : 0 to 65535
Interval Time: 0 to 65535 seconds
Interfaces   : 0  Disable; 1  Enable
 For Modem Event Report:
   0 / 1 : Modem
   0 / 1 : WWAN
   0 / 1 : WWAN IP
 For Management Report:
   0 / 1 : Ethernet
   0 / 1 : WWAN
   0 / 1 : Network
OK
UserDevice> AT+MAEURD3=           

UserDevice> AT+MANMSR?
Mode        : 0. Disabled
OK
UserDevice> AT+MANMSR=?
Command Syntax:
AT+MANMSR[=<Mode>[,<NMS Server/IP>,<Remote Port>,<Interval Time>[,<Interfaces>]]]
Mode         : 0  Disable
               1  Enable
NMS Server/IP: 1 to 63 characters
Remote Port  : 0 to 65535
Interval Time: 0 to 65535 seconds
Interfaces   : 0  Disable; 1  Enable
   0 / 1 : Ethernet
   0 / 1 : WWAN
   0 / 1 : Network
OK
UserDevice> AT+MANMSR=          

UserDevice> AT+MANMSSRV?
+MANMSSRV:
  Server   : nms.microhardcorp.com
  Name     : default
  Password : ********
OK
UserDevice> AT+MANMSSRV=?
Command Syntax:AT+MANMSSRV[=<Server>,<Name>,<Password>,<Confirm Password>]
<Server>: 
  NMS Server/IP. 1 to 63 characters
<Name>:
  Domain Name. 1 to 63 characters
<Password>:
  Domain Password. 5 to 64 characters
<Confirm Password>:
  Same as <Password>. 5 to 64 characters
OK
UserDevice> AT+MANMSSRV=            

UserDevice> AT+MAWSCLIENT?
+MAWSCLIENT:
  Mode        : 0 - Disable
OK
UserDevice> AT+MAWSCLIENT=?
Command Syntax:AT+MAWSCLIENT[=<Mode>[,<ServerType>,<Port>,<UserName>,<Password>,<Interval>]]
<Mode>:
  0 - Disable
  1 - Enable
<ServerType>: 
  0 - https
  1 - http
<Port>: 
  1 to 65535. Default is 9998
<UserName>:
  1 to 63 characters
<Password>:
  5 to 64 characters
<Interval>:
  In minute. 1 to 65535 minutes.
OK
UserDevice> AT+MAWSCLIENT=              

UserDevice> AT+MADISS?
+MADISS:
  Mode : 1 - Discoverable
  Server port : 20097
OK
UserDevice> AT+MADISS=?
Command Syntax:AT+MADISS[=<Mode>[,<Port>]]
Mode:
  0 - Disable
  1 - Discoverable
Port: 
  1 to 65535. Default is 20097
OK
UserDevice> AT+MADISS=          

UserDevice> AT+MASNMP?
+MASNMP:
  Mode        : Disable
OK
UserDevice> AT+MASNMP=?
Command Syntax:AT+MASNMP[=<Mode>[,<ROCommunity>,<RWCommunity>,<Port>,<Version>[,<Location>,<Contact>]]]
<Mode>:
  0 - Disable
  1 - Enable
<ROCommunity>: Read Only Community Name
  1 to 32 characters
<RWCommunity>: Read Write Community Name
  1 to 32 characters
<Port>: Listening Port 
  1 to 65535. Default is 161
<Version>: SNMP version
  1 - Version 1
  2 - Version 2
  3 - Version 3 (Use AT+MASNMPV3 to set Authentication and Privacy parameters)
<Location>: System Location. 1 to 64 characters
<Contact>: System Contact. 1 to 64 characters
OK
UserDevice> AT+MASNMP=          

UserDevice> AT+MASNMPV3?
+MASNMPV3:
  UserName        : userV3
  RWLimit         : Read Only
  AuthLevel       : NoAuthNoPriv
OK
UserDevice> AT+MASNMPV3=?
Command Syntax:AT+MASNMPV3=<UserName>,<RWLimit>,<AuthLevel>[,<Auth>,<AuthPassword>[,<Privacy>,<PrivacyPassword>]]
<UserName>       : V3 User Name
  1 to 32 characters
<RWLimit>        : V3 User Read Write Limit
  0 - Read Only
  1 - Read Write
<AuthLevel>      : V3 User Authentication Level
  0 - NoAuthNoPriv
  1 - AuthNoPriv
  2 - AuthPriv
<Auth>           : V3 Authentication Protocol
  0 - MD5
  1 - SHA
<AuthPassword>   : V3 Authentication Password
  8 to 64 characters
<Privacy>        : V3 Privacy Protocol
  0 - DES
  1 - AES
<PrivacyPassword>: V3 Privacy Password
  8 to 64 characters
Usage:
  NoAuthNoPriv : AT+MASNMPV3=<UserName>,<RWLimit>,0
  AuthNoPriv   : AT+MASNMPV3=<UserName>,<RWLimit>,1,<Auth>,<AuthPassword>
  AuthPriv     : AT+MASNMPV3=<UserName>,<RWLimit>,2,<Auth>,<AuthPassword>,<Privacy>,<PrivacyPassword>
OK
UserDevice> AT+MASNMPV3=            

UserDevice> AT+MASNMPTRAP?
+MASNMPTRAP:
  Mode             : 0 - Disable
OK
UserDevice> AT+MASNMPTRAP=?
Command Syntax:AT+MASNMPTRAP[=<Mode>[,<Name>,<IP>[,<AuthFailureTraps>]]
<Mode>:
  0 - Disable
  1 - Enable
<Name>: 
  Trap Community Name. 1 to 32 characters
<IP>: 
  Trap Manage Host IP. Default 0.0.0.0 (Disable)
<AuthFailureTraps>:
  0 - Disable
  1 - Enable
Usage:
  AT+MASNMPTRAP
  AT+MASNMPTRAP=0
  AT+MASNMPTRAP=1[,<Name>,<IP>[,<AuthFailureTraps>]]
OK
UserDevice> AT+MASNMPTRAP=              

UserDevice> AT+MAIOTSSL?
+MAIOTSSL:
  Mode:Disable
OK
UserDevice> AT+MAIOTSSL=?
Command Syntax:AT+MAIOTSSL[=<Mode>[,<Host>,<Port>,<Registration Code>]
  <Mode>: 0 - Disable, 1 - Enable
  <Host>: 2 - 255 characters
  <Port>: 1 - 65535
  <Registration Code>: 1 - 250 characters
OK
UserDevice> AT+MAIOTSSL=            

UserDevice> AT+MFGEN1?
      Remote Management     Remote Access      LAN Outgoing
 WWAN             Allow             Block             Allow
OK
UserDevice> AT+MFGEN1=?
Command Syntax:AT+MFGEN1[=<WAN>[,<Remote Management>,<Remote Access>,<LAN Outgoing>]]
Firewall General Configuration:
Parameters
 WAN Connection    : 0 - WWAN
 Remote Management : 0 - Block
                     1 - Allow
 Remote Access     : 0 - Block
                     1 - Allow
 LAN Outgoing      : 0 - Block
                     1 - Allow
OK
UserDevice> AT+MFGEN1=          

UserDevice> AT+MFGEN2?
 Anti-Spoof           : Disable
 Packet Normalization : Disable
OK
UserDevice> AT+MFGEN2=?
Command Syntax:AT+MFGEN2[=<Config>[,<Mode>]]
Firewall General Configuration: 
Parameters
 Config : 0 - Anti-Spoof
          1 - Packet Normalization
 Mode   : 0 - Disable
          1 - Enable
OK
UserDevice> AT+MFGEN2=          

UserDevice> AT+MFDMZ?
DMZ Source      : WWAN
 DMZ Mode       : Disable
 DMZ Server IP  : 192.168.168.100
 Exception Port : 80,443,22
 Source NAT     : no
OK
UserDevice> AT+MFDMZ=?
Command Syntax: 
 AT+MFDMZ[=<WAN>[,<DMZ Mode>[,<DMZ Server IP>,<Exception Port>,<SNAT>]]]
Parameters:
 WAN            : 0 - WWAN
 DMZ Mode       : 0 - Disable
                  1 - Enable
 DMZ Server IP  : Valid IP address
 Exception Port : 0 - 65535
 Source NAT     : 0 - No; 1 - Yes
OK
UserDevice> AT+MFDMZ=         

UserDevice> AT+MFPORTFWD?
No firewall port forwarding rules
OK
UserDevice> AT+MFPORTFWD=?
Command Syntax:
 AT+MFPORTFWD[=<Name>[,<Operation>[,<Source>,<Internal IP>,<Internal Port>,<Protocol>,<External Port>,<SNAT>]]]
Parameters:
 Name          : Name of Port Forwarding rule, 1 - 64 characters
 Operation     : ADD  - Add a rule
                 EDIT - Edit a rule
                 DEL  - Delete a rule
 Source        : 0 - WWAN
                 1 - OpenVPN
 Internal IP   : Valid IP address
 Internal Port : Valid port number, 0 - 65535. 0 - Reset
 Protocol      : 0 - TCP
                 1 - UDP
                 2 - TCPUDP
 External Port : Valid port number, 1 - 65535
 Source NAT    : 0 - No; 1 - Yes
Usage:
 AT+MFPORTFWD
 AT+MFPORTFWD=<Name>
 AT+MFPORTFWD=<Name>,DEL
 AT+MFPORTFWD=<Name>,ADD,<Source>,<Internal IP>,<Internal Port>,<Protocol>,<External Port>,<SNAT>
 AT+MFPORTFWD=<Name>,EDIT,<Source>,<Internal IP>,<Internal Port>,<Protocol>,<External Port>,<SNAT>
OK
UserDevice> AT+MFPORTFWD=             

UserDevice> AT+MFMAC?
No firewall MAC list
OK
UserDevice> AT+MFMAC=?
Command Syntax:
 AT+MFMAC[=<Name>[,<Operation>[,<Action>,<Mac Address>]]]
Parameters:
 Name        : Name of firewall MAC list name, 1 - 64 characters
 Operation   : ADD  - Add a firewall MAC list
               EDIT - Edit a firewall MAC list
               DEL  - Delete a firewall MAC list
 Action      : 0 - Accept
               1 - Drop
               2 - Reject
 MAC Address : Valid MAC address
Usage:
 AT+MFMAC
 AT+MFMAC=<Name>
 AT+MFMAC=<Name>,DEL
 AT+MFMAC=<Name>,ADD,<Action>,<Mac Address>
 AT+MFMAC=<Name>,EDIT,<Action>,<Mac Address>
OK
UserDevice> AT+MFMAC=         

UserDevice> AT+MFIP?
No firewall IP list
OK
UserDevice> AT+MFIP=?
Command Syntax:
 AT+MFIP[=<Name>[,<Operation>[,<Action>,<Source>,<IP Address>[,<Prefix>]]]]
Parameters:
 Name      : Name of firewall IP list name, 1 - 64 characters
 Operation : ADD  - Add a firewall IP list
             EDIT - Edit a firewall IP list
             DEL  - Delete a firewall IP list
 Action    : 0 - Accept
             1 - Drop
             2 - Reject
 Source    : 0 - LAN
             1 - WWAN
             2 - OpenVPN
 Source IP : Valid IP address
 Prefix    : 0 ~ 32. 32 (default) - single IP address
Usage:
 AT+MFIP
 AT+MFIP=<Name>
 AT+MFIP=<Name>,DEL
 AT+MFIP=<Name>,ADD,<Action>,<Source>,<IP Address>[,<Prefix>]
 AT+MFIP=<Name>,EDIT,<Action>,<Source>,<IP Address>[,<Prefix>]
OK
UserDevice> AT+MFIP=        

UserDevice> AT+MFRULE?
No firewall rules
OK
UserDevice> AT+MFRULE=?
Command Syntax:
 AT+MFRULE[=<Name>[,<Operation>[,<Type>,<Action>,
            <Source>,<Src IP Format>,<Src IP From/Subnet>,<Src IP To/Prefix>,
            <Destination>,<Dest IP Format>,<Dest IP From/Subnet>,<Dest IP To/Prefix>,
            <Dest Port>,<Protocol>]]]
Parameters:
 Name           : Name of firewall rule name, 1 - 64 characters
 Operation      : ADD  - Add a firewall rule
                  EDIT - Edit a firewall rule
                  DEL  - Delete a firewall rule
 Type           : 0 - Input
                  1 - Output
                  2 - Forward
 Action         : 0 - Accept
                  1 - Drop
                  2 - Reject
 Source         : (Must be "Any", if Type is Output)
                  0 - LAN
                  1 - WWAN
                  2 - OpenVPN
                  3 - Any
  IP Format     : 0 - IP Range
                  1 - Subnet / Prefix
  IP From/Subnet: Valid IP address
  IP To/Prefix  : Valid IP address or 0 ~ 32 for Prefix
 Destination    : (Must be "Any", if Type is Input)
                  0 - LAN
                  1 - WWAN
                  2 - OpenVPN
                  3 - Any
  IP Format     : 0 - IP Range
                  1 - Subnet / Prefix
  IP From/Subnet: Valid IP address
  IP To/Prefix  : Valid IP address or 0 ~ 32 for Prefix
  Port/Range    : Port 1 ~ 65535 or Port range specified as 100:200 format
                  For TCP/UDP protocol use, left empty when no port/port range is specified.
 Protocol       : 0 - TCP
                  1 - UDP
                  2 - TCPUDP
                  3 - ICMP
                  4 - Protocol 41
                  5 - GRE
                  6 - ALL
OK
UserDevice> AT+MFRULE=          

UserDevice> AT+MFRST?
ERROR: Invalid parameters
UserDevice> AT+MFRST=?
Command Syntax:AT+MFRST
OK
UserDevice> AT+MFRST=         

UserDevice> AT+MMIMEI?
IMEI=869710032305918
OK
UserDevice> AT+MMIMEI=?
Command Syntax:AT+MMIMEI
OK
UserDevice> AT+MMIMEI=          

UserDevice> AT+MMIMSI?
IMSI=311480784005551
OK
UserDevice> AT+MMIMSI=?
Command Syntax:AT+MMIMSI
OK
UserDevice> AT+MMIMSI=          

UserDevice> AT+MMNETRSSI?
RSSI=-64
OK
UserDevice> AT+MMNETRSSI=?
Command Syntax:AT+MMNETRSSI
OK
UserDevice> AT+MMNETRSSI=             

UserDevice> AT+MMBOARDTEMP?
34 C
OK
UserDevice> AT+MMBOARDTEMP=?
Command Syntax:AT+MMBOARDTEMP
OK
UserDevice> AT+MMBOARDTEMP=               

UserDevice> AT+MMWANIP?
WANIP=100.96.109.124
OK
UserDevice> AT+MMWANIP=?
Command Syntax:AT+MMWANIP
OK
UserDevice> AT+MMWANIP=           

UserDevice> AT+MMNUM?
PHONENUM=Unknown
OK
UserDevice> AT+MMNUM=?
Command Syntax:AT+MMNUM
OK
UserDevice> AT+MMNUM=         

UserDevice> AT+MMIMI?
IMEI=869710032305918
IMSI=311480784005551
OK
UserDevice> AT+MMIMI=?
Command Syntax:AT+MMIMI
OK
UserDevice> AT+MMIMI=         

UserDevice> AT+MMCID?
SIMID=89148000008376990929
OK
UserDevice> AT+MMCID=?
Command Syntax:AT+MMCID
OK
UserDevice> AT+MMCID=         

UserDevice> AT+MMPIPP?
  Mode       : Disable
OK
UserDevice> AT+MMPIPP=?
Command Syntax:
  AT+MMPIPP[=<Mode>[,<Lease Time>,<IP Address>[,<SSH Service>,<Ping>[,<Modified LAN>]]]]
Parameters:
  Mode       : 0 - Disable
               1 - Ethernet
  Lease Time : IP-Passthrough DHCP lease time, 2 to 2880, in minutes
  IP Address : A virtual IP address set to LAN in ippassthrough Ethernet mode
  SSH Service: 0 - Disable; 1 - Enable
  Ping       : 0 - Disable; 1 - Enable
  ModifiedLAN: Up to 50 characters. Only for valid virtual lan interface. Keep blank for default LAN
Usage:
  AT+MMPIPP
  AT+MMPIPP=<Mode>                                                              Where <Mode> is 0 (Disable)
  AT+MMPIPP=<Mode>,<Lease Time>,<IP Address>                                    Where <Mode> is not 0 (Disable)
  AT+MMPIPP=<Mode>,<Lease Time>,<IP Address>,<SSH Serive>,<Ping>                Where <Mode> is not 0 (Disable)
  AT+MMPIPP=<Mode>,<Lease Time>,<IP Address>,<SSH Serive>,<Ping>,<Modified LAN> Where <Mode> is 1 (Ethernet)
OK
UserDevice> AT+MMPIPP=          

UserDevice> AT+MMAPN?
APN=auto
OK
UserDevice> AT+MMAPN=?
Command Syntax:AT+MMAPN[=<Index>[,<APN>]]
<Index> : SIM Card No.
          1 - SIM Card 1
<APN>   : Max 255 characters
OK
UserDevice> AT+MMAPN=         

UserDevice> AT+MMPOWERIN?
N/A
OK
UserDevice> AT+MMPOWERIN=?
Command Syntax:AT+MMPOWERIN
OK
UserDevice> AT+MMPOWERIN=             

UserDevice> AT+MMTYPE?
SIM Card No.1 : SIM Type - Auto Detect

OK
UserDevice> AT+MMTYPE=?
Command Syntax:AT+MMTYPE[=<Index>[,<SIM Type>]]
<Index>      :   0 - SIM Card 1  
<SIM Type>   :   0 : Auto Detect   1 : General/ATT Mode   2 : Verizon Mode
OK
UserDevice> AT+MMTYPE=          

UserDevice> AT+MMSIMS?
SIM CARD1 ONLY
OK

UserDevice> AT+MMSIMS=?
Command Syntax:
 AT+MMSIMS[=<SIM Selection>[,<Primary Slot>]]
Parameters:
 <SIM Selection> : 0 - Dual SIM Cards 
                   1 - SIM Card-1 Only 
                   2 - SIM Card-2 Only 
 <Primary Slot>  : 1 - SIM Card-1 
                   2 - SIM Card-2 
Usage: 
 AT+MMSIMS
 AT+MMSIMS=<SIM Selection> where <SIM Selection> = 1 or 2
 AT+MMSIMS=<SIM Selection>,<Primary Slot> where <SIM Selection> = 0
OK

UserDevice> AT+MMSIMS=          

UserDevice> AT+MMDNS?
SIM Card No.1:
  Use Carrier DNS       : Enable
OK
UserDevice> AT+MMDNS=?
Command Syntax:
  AT+MMDNS[=<Index>[,<Use Carrier DNS>,[<Primary DNS Address>,<Secondary DNS Address>]]]
Parameters:
<Index> : SIM Card No.
          1 - SIM Card 1
<Use Carrier DNS>       : 0 - Enable, 1 - Disbale
<Primary DNS Address>   : Valid IP address or 0 (Reset)
<Secondary DNS Address> : Valid IP address or 0 (Reset)
OK
UserDevice> AT+MMDNS=         

UserDevice> AT+MMDNSPIPP?
SIM Card No.1 DNS-Passthrough : Disable
OK
UserDevice> AT+MMDNSPIPP=?
Command Syntax:
  AT+MMDNSPIPP[=<Index>[,<Mode>]]
Parameters:
<Index> : SIM Card No.
          1 - SIM Card 1
<Mode>  : 0 - Disbale, 1 - Enable
OK
UserDevice> AT+MMDNSPIPP=             

UserDevice> AT+MNLAN?
1. LAN Configuration
 IP Address             : 192.168.168.1 (static)
 Subnet Mask            : 255.255.255.0 (static)
 LAN Alias              : no
 Spanning Tree (STP)    : off
 IGMP Snooping          : on
 DNS Server Mode        : manual
   Primary DNS          : 
   Secondary DNS        : 
 DHCP Server            : Enabled
   Start IP             : 192.168.168.100
   Limit                : 150
   Lease Time           : 720
   Alternate Gateway    : 
   Preferred DNS server : 
   Alternate DNS server : 
   WINS/NBNS Servers    : 
   WINS/NBT Node Type   : 
OK
UserDevice> AT+MNLAN=?
Command Syntax:
 AT+MNLAN
 AT+MNLAN=<LAN Name>
 AT+MNLAN=<LAN Name>,DEL
 AT+MNLAN=<LAN Name>,ADD/EDIT,<Protocol>[,<IP>,<Netmask>] Where <Protocol>=0
 AT+MNLAN=<LAN Name>,ADD/EDIT,<Protocol>                  Where <Protocol>=1 or <Protocol>=3
 AT+MNLAN=<LAN Name>,ADD/EDIT,<Protocol>,<IP>,<Netmask>   Where <Protocol>=2
Parameters:
 LAN Name   : Case Sensitive LAN interface name
              The reserved "lan" and "LAN" specify the same LAN port
 Operation  : ADD  - Add a new LAN interface
              EDIT - Edit an exsiting LAN interface
              DEL  - Delete an existing LAN interface
 Protocol   : 0 - Static IP
              1 - DHCP
              2 - Alias
              3 - NONE
 IP Address : Valid IP address
 Netmask    : Valid netmask
OK
UserDevice> AT+MNLAN=         

UserDevice> AT+MNLANDHCP?
ERROR: Missed <LAN Name> parameter
UserDevice> AT+MNLANDHCP=?
Command Syntax: 
  AT+MNLANDHCP=<LAN Name>[,<Mode>[,<Start IP>,<Limit>,<Lease Time>[,<Alt. Gateway>,
               <Pre. DNS>,<Alt. DNS>,<WINS/NBNS Servers>,<WINS/NBT Node>]]]
Parameters:
  LAN Name      : Name of Network LAN interface
  Mode          : 0 - Disable DHCP Server
                  1 - Enable  DHCP Server
  Start IP      : The starting address DHCP assignable IP Addresses
  Limit         : The maximum number of IP addresses
  Lease Time    : The DHCP lease time in minutes. 2~2147483647 minutes. 0 means 'infinity'
  Alt. Gateway  : Alternate Gateway for DHCP assigned devices if the default gateway is not to be used
  Pre. DNS      : Preferred DNS server address to be assigned to DHCP devices
  Alt. DNS      : Alternate DNS server address to be assigned to DHCP devices
  WINS/NBNS Server : WINS/NBNS Servers
  WINS/NBT Node : WINS/NBT Node Type
                  0 - none
                  1 - b-node
                  2 - p-node
                  3 - m-node
                  4 - h-node
OK
UserDevice> AT+MNLANDHCP=             

UserDevice> AT+MNLANSTP?
ERROR: Missed <LAN Name> parameter
UserDevice> AT+MNLANSTP=?
Command Syntax: 
  AT+MNLANSTP=<LAN Name>[,<STP>]
Parameters:
  LAN Name      : Name of Network LAN interface
  Spanning Tree : 0 - Off
                  1 - On
OK
UserDevice> AT+MNLANSTP=            

UserDevice> AT+MNLANIGMP?
ERROR: Missed <LAN Name> parameter
UserDevice> AT+MNLANIGMP=?
Command Syntax: 
  AT+MNLANIGMP=<LAN Name>[,<IGMP Snooping>]
Parameters:
  LAN Name      : Name of Network LAN interface
  IGMP Snooping : 0 - Off
                  1 - On
OK
UserDevice> AT+MNLANIGMP=             

UserDevice> AT+MNLANDNS?
ERROR: Missed <LAN Name> parameter
UserDevice> AT+MNLANDNS=?
Command Syntax: 
 AT+MNLANDNS=<LAN Name>[,<Mode>[,<Primary DNS>,<Secondary DNS>]]
Usage:
 AT+MNLANDNS=<LAN Name>
 AT+MNLANDNS=<LAN Name>,<Mode>                                 Where <Mode>=0
 AT+MNLANDNS=<LAN Name>,<Mode>[,<Primary DNS>,<Secondary DNS>] Where <Mode>=1
Parameters:
 LAN Name      : Name of Network LAN interface
 Mode          : 0 - Auto
                 1 - Manual
 Primary DNS   : Valid IP Address or 0 (Reset)
 Secondary DNS : Valid IP address or 0 (Reset)
OK
UserDevice> AT+MNLANDNS=            

UserDevice> AT+MNIPMAC?
Static Addresses:
  N/A
Active DHCP Leases:
  EC:8E:B5:49:F4:12 192.168.168.126 DESKTOP-4JFU4LH (Expires in 11hr 58min 33sec)
OK
UserDevice> AT+MNIPMAC=?
Command Syntax:
  AT+MNIPMAC[=<Operation>[,<Name>[,<IP Address>,<MAC Address>]]]
Usage: 
  AT+MNIPMAC
  AT+MNIPMAC=SHOW,<Name>
  AT+MNIPMAC=ADD,<Name>,<IP Address>,<MAC Address>
  AT+MNIPMAC=DEL,<NAME>
  AT+MNIPMAC=RELEASE,<NAME>
  AT+MNIPMAC=RELEASEALL
Parameters:
  Operation  : SHOW - Static/Active MAC-IP address binding
               ADD  - Static MAC-IP address binding
               DEL  - Static MAC-IP address binding
               RELEASE - Active DHCP lease
               RELEASEALL - All active DHCP leases
  Name       : Name of the MAC-IP binding, 1-64 characters
  IP Address : Valid IP address
  MAC Address: The physical MAC address of the device or interface
OK
UserDevice> AT+MNIPMAC=           

UserDevice> AT+MNEMAC?
+MNEMAC: "00:0F:92:0C:7E:E0"
OK
UserDevice> AT+MNEMAC=?
Command Syntax:AT+MNEMAC
OK
UserDevice> AT+MNEMAC=          

UserDevice> AT+MNPORT?
  Port     Mode Auto-Negotiation Advertise/Force
Port 1     auto 
OK
UserDevice> AT+MNPORT=?
Command Syntax: 
 AT+MNPORT[=<Ethernet Port>[,<Mode>[,<Auto Negotiation>[,
           <10M-Full>,<10M-Half>,<100M-Full>,<100M-Half>,<1G-Full>,<1G-Half>]]]]
Parameters:
 Ethernet Port:
  0 - Port 1
 Mode: 
  0 - Auto
  1 - Manual
  2 - Disabled
 Auto-Negotiation:
  0 - Off
  1 - On
 Advertise/Force:
  0 - Disable / 1 - Enable : 10 Mbit/s Full Duplex
  0 - Disable / 1 - Enable : 10 Mbit/s Half Duplex
  0 - Disable / 1 - Enable : 100 Mbit/s Full Duplex
  0 - Disable / 1 - Enable : 100 Mbit/s Half Duplex
  0 - Disable / 1 - Enable : 1 Gbit/s Full Duplex
  0 - Disable / 1 - Enable : 1 Gbit/s Half Duplex
Notes: 1 Gbit/s can be used only with auto-negotiation
       Only single speed-duplex setting can be used when auto-negotiation is off
       Avoid using Full Duplex when auto-negotiation is off (unless other side uses exactly same port setting)
OK
UserDevice> AT+MNPORT=          

UserDevice> AT+MNSTATUS?
LAN:
  MAC Address       : 00:0F:92:0C:7E:E0
  IP Address        : 192.168.168.1 (static)
  Subnet Mask       : 255.255.255.0 (static)
  Receive bytes     : 263.915KB
  Receive packets   : 1101 
  Transmit bytes    : 143.710KB
  Transmit packets  : 944 
WWAN:
  MAC Address       : 00:0F:92:FE:00:01
  IP Address        : 100.96.109.124
  Subnet Mask       : 255.255.255.255
  Receive bytes     : 52.979KB
  Receive packets   : 214 
  Transmit bytes    : 220.812KB
  Transmit packets  : 738 
Default Gateway     : 100.0.0.1
DNS Server(s)       : 198.224.145.135 198.224.144.135

IPv4 Routing Table
Destination     Gateway         Subnet Mask     Flags Metric Ref    Use Iface
0.0.0.0         100.0.0.1       0.0.0.0         UG    25     0        0 br-wwan
100.0.0.1       0.0.0.0         255.255.255.255 UH    25     0        0 br-wwan
100.96.109.124  0.0.0.0         255.255.255.255 UH    25     0        0 br-wwan
169.254.0.0     0.0.0.0         255.255.0.0     U     0      0        0 br-lan
192.168.168.0   0.0.0.0         255.255.255.0   U     0      0        0 br-lan
OK
UserDevice> AT+MNSTATUS=?
Command Syntax:AT+MNSTATUS
OK
UserDevice> AT+MNSTATUS=            

UserDevice> AT+MNDDNSE?
+MNDDNSE: Mode 0 
OK
UserDevice> AT+MNDDNSE=?
Command Syntax:
  AT+MNDDNSE=<Mode>
Parameter:
  Mode: 0 - Disable
        1 - Enable
OK
UserDevice> AT+MNDDNSE=           

UserDevice> AT+MNDDNS?
+MNDDNS:
 Network         : 0 - Auto
 User Name       :  
 Password        :  
 Host            :  
OK
UserDevice> AT+MNDDNS=?
Command Syntax:
  AT+MNDDNS=<Network>,<Periodic Update>,<Service>,<User Name>,<Password>,<Host> or <Record Number>[,<Url>]
Parameters:
  Network         : 0 - Auto
                    1 - WWAN
  Periodic Update : 0 - Disable
                    1 - 5 minutes
                    2 - 15 minutes
                    3 - 60 minutes
                    4 - 4 hours
                    5 - 8 hours
                    6 - 24 hours
  Service Type    : 0 - changeip
                    1 - dyndns
                    2 - eurodyndns
                    3 - hn
                    4 - noip
                    5 - ods
                    6 - ovh
                    7 - regfish
                    8 - tzo
                    9 - zoneedit
                    10 - customized_ddns
                    11 - DNSmadeEasy
  User Name       : 1 - 64 characters
  Password        : 1 - 64 characters
  Host            : 1 - 200 characters, for any services except DNSmadeEasy
  Record Number   : 1 - 200 characters, for DNSmadeEasy only
  Url             : 1 - 200 characters, for customized_ddns
OK
UserDevice> AT+MNDDNS=          

UserDevice> AT+MNNETSP?
  Netperf Server Address : netperf-west.bufferbloat.net
  Netperf Server Port    : 12865
  Duration               : 30
OK
UserDevice> AT+MNNETSP=?
Command Syntax:
 AT+MNNETSP[=<Netperf Server>[,<Duration(seconds)>]
 AT+MNNETSP[=4,<Netperf Server Address>[,<Netperf Server Port>,<Duration(seconds)>]
Parameters:
 <NETPERF Server> : 0 - netperf.bufferbloat.net 
                    1 - netperf-east.bufferbloat.net 
                    2 - netperf-west.bufferbloat.net 
                    3 - netperf-eu.bufferbloat.net 
                    4 - customerserver 
 <Duration>       : 1-60 
 <Netperf Server Address>    : customer netperf server address 
 <Netperf Server Port>       : 0-65535 
OK

UserDevice> AT+MNNETSP=           

UserDevice> AT+MNPINGTM?
  Ping Server Address : 8.8.8.8
OK
UserDevice> AT+MNPINGTM=?
Command Syntax:
 AT+MNPINGTM[=<Ping Server>[,<Ping Count>[,<Ping Size>]]]
Parameters:
 <Ping Server> : Valid IP Address 
 <Ping Count>  : > 0, integer count 
 <Ping Size>   : 5-15000 
OK

UserDevice> AT+MNPINGTM=            

UserDevice> AT+MNOPENDNS?
OpenDNS Cloud Filter     : Disable
OK
UserDevice> AT+MNOPENDNS=?
Command Syntax:
  AT+MMOPENDNS[=<Mode>[, <Forbid Bypassing OpenDNS>, <Dynamic IP>, [ <Domain>, <User Name>, <Password>]]]
Parameters:
<Mode>        : 0 - Disbale, 1 - Enable
<Forbid Bypassing OpenDNS>  : 0 - No, 1 - Yes
<Dynamic IP>  : 0 - No, 1 - Yes
<Domain>      : 1 to 64 characters
<User Name>   : 1 to 64 characters
<Password>    : 5 to 64 characters
OK
UserDevice> AT+MNOPENDNS=             

UserDevice> AT+MSCNTO?
+MSCNTO: 120 seconds
OK
UserDevice> AT+MSCNTO=?
+MSCNTO:
Command Syntax:
  AT+MSCNTO=<Timeout_s>
Parameter:
  <Timeout_s> : 30 to 65535 in seconds, 0-Disable
OK
UserDevice> AT+MSCNTO=          

UserDevice> AT+MSPWD?
ERROR: Invalid parameter(s)
UserDevice> AT+MSPWD=?
+MSPWD:
Command Syntax:
  AT+MSPWD=<New Password>,<Confirm Password>
Parameters:
  <New Password>     : 5-64 characters except space
  <Confirm Password> : Same as <New Password>
OK
UserDevice> AT+MSPWD=         

UserDevice> AT+MSGMI?
+MSGMI: 2017-2022 Microhard Systems Inc.
OK
UserDevice> AT+MSGMI=?
Command Syntax:AT+MSGMI
OK
UserDevice> AT+MSGMI=         

UserDevice> AT+MSSYSI?
System:
  Host Name   : UserDevice
  Product     : LTECube-CAT12
  Hardware    : 1.0
  Software    : v1.5.0 build 1044
  Copyright   : 2017-2022 Microhard Systems Inc.
  System Time : Sun Oct 23 15:41:56 2022
WWAN:
  Module      : Enabled
  IMEI        : 869710032305918
  SIMID       : 89148000008376990929
  Status(APN) : Connected(vzwinternet)
  Network     : VerizonWireless
  IP          : 100.96.109.124
  RSSI        : -65
LAN:
  MAC         : 00:0F:92:0C:7E:E0
  IP          : 192.168.168.1 (static)
  MASK        : 255.255.255.0 (static)
OK
UserDevice> AT+MSSYSI=?
Command Syntax:AT+MSSYSI
OK
UserDevice> AT+MSSYSI=          

UserDevice> AT+MSGMR?
+MSGMR:
 Hardware Version : 1.0
 Software Version : v1.5.0 build 1044
 Copyright        : 2017-2022 Microhard Systems Inc.
 System Time      : Sun Oct 23 15:41:57 2022
OK
UserDevice> AT+MSGMR=?
Command Syntax:AT+MSGMR
OK
UserDevice> AT+MSGMR=         

UserDevice> AT+MSIMG?
 Active Version      : v1.5.0-r1044
 Active Build Time   : 2022-04-04 09:28:38
 Inactive Version    : v1.5.0-r1044
 Inactive Build Time : 2022-04-04 09:28:38
OK
UserDevice> AT+MSIMG=?
Command Syntax:AT+MSIMG
OK
UserDevice> AT+MSIMG=         

UserDevice> AT+MSMNAME?
Host name:UserDevice 
OK
UserDevice> AT+MSMNAME=?
+MSMNAME:
Command Syntax:
  AT+MSMNAME=<Modem_Name>
Parameter:
  <Modem_Name> : 1 - 64 characters. Must be alphanumeric, dashes(-) or underscores(_)
OK
UserDevice> AT+MSMNAME=           

UserDevice> AT+MSRTF?
ERROR: Invalid parameter(s)
UserDevice> AT+MSRTF=?
+MSRTF:
Command Syntax:
  AT+MSRTF=<Action>
Parameter:
  <Action>: 0 - Pre-set action
            1 - Confirm action
OK
UserDevice> AT+MSRTF=         

UserDevice> AT+MSREB?
ERROR: Invalid parameter(s)
UserDevice> AT+MSREB=?
+MSREB: Command Syntax:AT+MSREB
OK
UserDevice> AT+MSREB=         

UserDevice> AT+MSNTP?
+MSNTP: 
  Mode                     : 0 - Local Time
  Server                   : pool.ntp.org
  Client Interval          : 3600
  Current Date(yyyy-mm-dd) : 2022-10-23
  Current Time(hh:mm:ss)   : 15:41:59
OK
UserDevice> AT+MSNTP=?
+MSNTP:
Command Syntax:
  AT+MSNTP=<Mode>[,<Date>,<Time>,<Server>,<Client Interval>]
  AT+MSNTP=<Mode>[,<Server>,<Client Interval>]
Parameters:
  <Mode>                  : 0 - Local Time; 1 - NTP
    <Mode=0>
        <Date>            : yyyy-mm-dd
        <Time>            : hh:mm:ss
    <Mode=0 or 1>
        <Server>          : Valid IP Address or Name
        <Client Interval> : 15 to 8640000 in seconds, 0-Disable
OK
UserDevice> AT+MSNTP=         

UserDevice> AT+MSNTPSVR?
+MSNTPSVR:
  Local NTP Server         : 
OK
UserDevice> AT+MSNTPSVR=?
+MSNTPSVR:
Command Syntax:
  AT+MSNTPSVR=<Mode>
Parameters:
  <Mode> : 0 - Disable ; 1 - Enable
OK
UserDevice> AT+MSNTPSVR=            

UserDevice> AT+MSSYSLOG?
  Syslog Server : 
  Syslog Port   : 514
OK
UserDevice> AT+MSSYSLOG=?
+MSSYSLOG:
Command Syntax:
  AT+MSSYSLOG[=<Server>[,<Port>]]
Parameters:
  <Server> : Valid IP Address or Name. 0.0.0.0 - Disable. 1 to 256 characters
  <Port>   : 1 to 65535. Default is 514
OK
UserDevice> AT+MSSYSLOG=            

UserDevice> AT+MSSERVICE?
FTP    : Enable
Telnet : Disable  Port: 23
SSH    : Enable   Port: 22
 Local tunneling: Block  
 Remote Tunneling: Block  
 Password Authentication: Allow   
OK
UserDevice> AT+MSSERVICE=?
+MSSERVICE:
Command Syntax:
  AT+MSSERVICE[=<Service>[,<Mode>[,<Port>[,<LocalTunneling>,<RemoteTunneling>,<PasswordAuth>]]]]
Parameters:
  <Service> : 0 - FTP
              1 - Telnet
              2 - SSH
  <Mode>    : 0 - Disable; 1 - Enable
  <Port>    : 1 to 65535. For Telnet (23 by default) and SSH (22 by default) only
SSH Options:
  <Local Tunneling> : 0 - Block; 1 - Allow
  <Remote Tunneling> : 0 - Block; 1 - Allow
  <Password Authentication> : 0 - Block; 1 - Allow
Note        : Not require AT&W
OK
UserDevice> AT+MSSERVICE=             

UserDevice> AT+MSWEBUI?
Web UI : HTTP/HTTPS   Port : 80 HTTP / 443 HTTPS
OK
UserDevice> AT+MSWEBUI=?
+MSWEBUI:
Command Syntax:
  AT+MSWEBUI[=<Mode>[,<HTTP Port>][,<HTTPS Port>]]]
Parameters:
  <Mode>       : 0 - HTTP/HTTPS
                 1 - HTTP
                 2 - HTTPS
                 3 - Disable
  <HTTP Port>  : 1 to 65535. 80 by default
  <HTTPS Port> : 1 to 65535. 443 by default
Usages:
  AT+MSWEBUI
  AT+MSWEBUI=<Mode>[,<HTTP Port>,<HTTPS Port>] when <Mode>=0
  AT+MSWEBUI=<Mode>[,<HTTP Port>]              when <Mode>=1
  AT+MSWEBUI=<Mode>[,<HTTPS Port>]             when <Mode>=2
  AT+MSWEBUI=<Mode>                            when <Mode>=3
Note        : Not require AT&W
OK
UserDevice> AT+MSWEBUI=           

UserDevice> AT+MSKA?
  Mode           : 1 - Enable
  Traffic Check  : 0 - Disable
  CLI Activity   : 0 - Disable
  Web UI Activity: 0 - Disable
OK
UserDevice> AT+MSKA=?
Command Syntax:
  AT+MSKA[=<Mode>[,<Traffic Check>,<CLI Activity>,<Web UI Activity>]]
Parameters:
  Mode           : 0 - Disable
                   1 - Enable
  Traffic Check  : 0 - Disable
                   1 - Enable
  CLI Activity   : 0 - Disable
                   1 - Enable
  Web UI Activity: 0 - Disable
                   1 - Enable
OK
UserDevice> AT+MSKA=        

UserDevice> AT+MSKAS?
  Type       : 0 - ICMP
  Host Name  : 8.8.8.8 
  Interval   : 300 
  Retry      : 20 
  HTTP Port  : 80 
OK
UserDevice> AT+MSKAS=?
Command Syntax:
  AT+MSKAS[=<Type>,<Host Name>,<Interval>,<Retry>[,<HTTP Port>]]
Parameters:
  Type       : 0 - ICMP
               1 - HTTP
               2 - DNS Lookup
  Host Name  : Valid host name, 1 to 256 characters
  Interval   : Keepalive Interval in second, 60 to 60000
  Retry      : Keepalive Retry, 10 to 200
  HTTP Port  : Valid HTTP Port, 1 to 65535
OK
UserDevice> AT+MSKAS=         

UserDevice> AT+MSAUTH?
+MSAUTH:
 Web Service     : Local Only
 Telnet & Console: Local Only
 SSH             : Local Only
OK
UserDevice> AT+MSAUTH=?
Command Syntax:AT+MSAUTH=[<Service>[,<Auth Method>,[<Server1>,<Port1>,<Secret1>[,<Server2>,<Port2>,<Secret2>]]]]
Parameters:
  <Service>     : 0 - Web Service, 1 - Telnet & Console, 2 - SSH
  <Auth Method> : 0 - Local Only
                  1 - Radius Or Local
                  2 - Radius and Local
                  3 - Radius Only
  <Server1>     : Radius Server1
  <Port1>       : Radius Server1 Port, 1 - 65535
  <Secret1>     : Radius Server1 Secret
  <Server2>     : Radius Server2
  <Port2>       : Radius Server2 Port, 1 - 65535
  <Secret2>     : Radius Server2 Secret
OK
UserDevice> AT+MSAUTH=          

UserDevice> AT+MGPSSTA?
+MGPSSTA : Disable
OK
UserDevice> AT+MGPSSTA=?
Command Syntax:AT+MGPSSTA[=<Mode>]
Parameters:
  Mode  : 0  Disable
          1  Enable
OK
UserDevice> AT+MGPSSTA=           

UserDevice> AT+MGPSPORT?
+MGPSPORT : 2947
OK
UserDevice> AT+MGPSPORT=?
Command Syntax:AT+MGPSPORT[=<Port Number>]
Parameters:
  Port Number  : 1-65535
OK
UserDevice> AT+MGPSPORT=            

UserDevice> AT+MGPSSRC?
+MGPSSRC : Standalone GPS(Built-in) 
OK
UserDevice> AT+MGPSSRC=?
Command Syntax:AT+MGPSSRC[=<GPS Source>]
Parameters:
  GPS Source : 1 - Standalone GPS(Built-in)
OK
UserDevice> AT+MGPSSRC=           

UserDevice> AT+MGPSNMEA?
+MGPSNMEA:
 GPS is disabled
OK
UserDevice> AT+MGPSNMEA=?
Command Syntax:AT+MGPSNMEA
OK
UserDevice> AT+MGPSNMEA=            

UserDevice> AT+MGPSANTEN?
OK
UserDevice> AT+MGPSANTEN=?
Command Syntax:AT+MGPSANTEN[=<Antenna Connection>]
Parameters:
  Antenna Connection : 0 - DIV PORT Passive  1 - GPS PORT Passive  2 - GPS PORT Active  
OK
UserDevice> AT+MGPSANTEN=             

UserDevice> AT+MSOPTRST?
ERROR: Invalid parameters.

UserDevice> AT+MSOPTRST=?
+MSOPTRST:
Command Syntax:
  AT+MSOPTRST=<Action>,<Keep Carrier Settings>,<Keep IoT Settings>,<Wipeout data and logs>
Parameter:
  <Action>                : 0 - Pre-set action and options
                            1 - Confirm action and options
  <Keep Carrier Settings> : 0 - Disable; 1 - Enable
  <Keep IoT Settings>     : 0 - Disable; 1 - Enable
  <Wipeout data and logs> : 0 - Disable; 1 - Enable
OK

UserDevice> AT+MSOPTRST=            

UserDevice> Entering character mode
Escape character is '^]'.
